{"lea":[{"id":"lea-1","text":"In my team we know where and how to address roadblocks","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"lea-2","text":"My team's leaders remove the roadblocks for us","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"lea-4","text":"We get the right enabling measures and tools to work in an agile set-up","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"lea-5","text":"We have a continuous dialogue with our leaders about the responsibilities in the team","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"lea-7","text":"My team's leaders accept and trust our decisions","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"lea-8","text":"Decentralized Decision Making - Which answer describes the situation in your team the best?","opt1":"Decisions are centralized, regardless of frequency, time criticality, and impact","opt2":"Decisions are rarely decentralized even if they are frequent, time critical, and do not have global economies of scale","opt3":"Decisions are sometimes decentralized when they are frequent, time critical, and do not have global economies of scale","opt4":"Decisions are usually decentralized when they are frequent, time critical, and do not have global economies of scale","opt5":"Decisions are always decentralized when they are frequent, time critical, and do not have global economies of scale"}],"pro":[{"id":"pro-6","text":"We know the level of quality our customers expect","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"pro-7","text":"My team meets the quality expectations","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"pro-8","text":"In my team everybody knows our quality standards","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"pro-10","text":"In my team we inspect and adapt possible bottlenecks in our value chain","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"pro-12","text":"Team Level Product Management  - Which answer describes the situation in your team the best?","opt1":"Non-existent","opt2":"Working towards the next level over.","opt3":"There is a single product-oriented person that does all of the following: making sure that there are sufficient ready stories at all times, attending all team-oriented planning meetings, accepting stories (for instance during iteration review), prioritizing the backlog. This person is available to fully answer questions about stories that are for the next 2-4 weeks immediately most of the time and within a couple of hours once in a while.","opt4":"80% of the time, people that have an opinion on the content or priority of a user story go to the team-level product person and not to members of the team. There is very close alignment between any product management people outside of the team level and the team level product person.","opt5":"There is an amazing rapport and alignment between strategic level product management, team level product management, and the team. Everybody understands and is executing on the product vision and all interaction within product management and the team and everybody follows well understood patterns and works smoothly."},{"id":"pro-16","text":"We usually capture many detailed requirements at the beginning of the project","opt1":"Strongly Agree","opt2":"Agree","opt3":"Neutral","opt4":"Disagree","opt5":"Strongly Disagree"}],"tco":[{"id":"tco-3","text":"In my team we do regularly complete our tasks","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tco-4","text":"In my team we defined our decision making processes and everybody understands them","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tco-5","text":"In my team we help and support each other","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tco-8","text":"We do have the required competences in the team","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tco-12","text":"In my team we do limit our Work In Progress (WIP)","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tco-19","text":"In my team we have the right amount of meetings, the right content, frequency and participants","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tco-26","text":"Team Size - Which answer describes the situation in your team the best?","opt1":">20 people on team","opt2":"It is recognised that a smaller team size is required and there is either a short-term plan or the team is actively reduced.","opt3":"15 to 20 people on the team","opt4":"10 to 14 people on the team","opt5":"5 to 9 people on the team"},{"id":"tco-27","text":"Dedicated Team - Which answer describes the situation in your team the best?","opt1":"Most team members are in several teams or work on several projects or have a line function.","opt2":"Most people are at least 50% assigned to the team, no one is less than 30% assigned to the team.","opt3":"Most persons are assigned to the team at least 70%. No one is less than 50% assigned to the team.","opt4":"Most people are at least 90% assigned to the team. No one is less than 70% assigned to the team.","opt5":"Most people are 100% assigned to the team, nobody is less than 60% assigned to the team."}],"tcu":[{"id":"tcu-5","text":"We accept failures and do learn from them","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tcu-10","text":"We do adapt the way we work based on our experiences","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tcu-18","text":"Stakeholder Involvement","opt1":"Stakeholders are not involved in the creation of a solution","opt2":"Stakeholders are loosely in contact with the team to discuss deliverables","opt3":"There is a regular and structured exchange between stakeholders and team members","opt4":"Stakeholders are involved in the working process and are informed about the different challenges","opt5":"Stakeholders are closely involved in the working process and can access the current state of work (i.e. by giving them access to the team board)"},{"id":"tcu-19","text":"Team Morale - Which answer describes the situation in your team the best?","opt1":"Active resistance to change. People often make hints about resigning or how bad the working environment or climate is.  Behavioural patterns such as finger pointing, denial, anger, screaming, betrayal, passive aggression and/or scapegoating regularly occur.","opt2":"There are still some of the behaviors of the previous situation, but steady improvements are emerging in these problem areas. Problems are addressed actively and purposefully with a common awareness that morale is improving.","opt3":"In general, people like to work together and are happy with their work.","opt4":"The team is productive, committed with a good team morale. In general, everyone works motivated and purposefully.","opt5":"The majority of the team members enjoy coming to work and look forward to the tasks ahead and feel they are part of one of the best teams they have ever worked in."},{"id":"tcu-20","text":"Teamwork - Which answer describes the situation in your team the best?","opt1":"Non-existent","opt2":"Teamwork improves","opt3":"At least 70% of the optimal setting","opt4":"Optimal setting is in sight - not far away of the ideal state, 20% to go.","opt5":"Between each individual and every other individual on the team, each believes that the other has the necessary skills, has high integrity, wants to and helps them to succeed, and is dependable."},{"id":"tcu-21","text":"Tuckman Stage - Which answer describes the situation in your team the best?","opt1":"Forming. Assembling a new team or integrating a team member who has joined or left the team.","opt2":"Storming. The team is just starting to figure out how to work together, and there is an unusual frequency of conflicts.","opt3":"Norming. The team has discovered the best way to work well together and is on its way to achieving excellent performance.","opt4":"The team has performed consistently for at least two months.","opt5":"The team has performed consistently for at least six months."},{"id":"tcu-22","text":"Sustainable Pace - Which answer describes the situation in your team the best?","opt1":"People are tired, irritable, burned out, working overtime routinely. The present circumstances are considered business as usual.","opt2":"It is acknowledged that the current pace is not sustainable and measures are being taken to improve the overall situation.","opt3":"There is broad acceptance that the team is working at a pace that is almost sustainable indefinitely, although there are still outbursts of heavy workloads.","opt4":"The team is supported by the organisation to work at a continuous speed. The team agrees that in 80% of cases the team works in line with the elements of sustainable speed in its team agreement.","opt5":"The company and the team take active measures to support work at a sustainable pace."},{"id":"tcu-23","text":"Discussion, criticizing and experimenting with the process is welcome","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"}],"tpe":[{"id":"tpe-1","text":"In my team we do believe in ourselves","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tpe-3","text":"In my team we do plan realistically","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tpe-4","text":"In my team we do act responsibly","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tpe-5","text":"Our stakeholders trust my team's planning","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tpe-8","text":"Resource Fluidity - Which answer describes the situation in your team the best?","opt1":"Resources are fixed and cannot be moved.","opt2":"Resources are checked and assigned twice a year.","opt3":"Resources are checked and assigned on a quarterly basis.","opt4":"The resources are allocated quarterly additional resources can be requested - duration about 1-2 months.","opt5":"Resources can be reassigned and/or moved within a few weeks' notice if necessary."},{"id":"tpe-9","text":"Environmental Scanning - Which answer describes the situation in your team the best?","opt1":"There is no sense of urgency on where to scan and actively search for information and opportunities within the organization.","opt2":"There is very limited sense of urgency to scan for new opportunities. Occasionally, there are impulses on where to look for opportunities and information.","opt3":"There is an understanding that environmental scanning is vital and it is on managerial levels.","opt4":"The organization has developed a good sense on where to scan for new opportunities and or developments (e.g., in technology, markets etc.)","opt5":"The organization has developed a strong sense on where to scan for new opportunities and or developments (e.g., in technology, markets etc.)"},{"id":"tpe-10","text":"Knowledge Acquisition - Which answer describes the situation in your team the best?","opt1":"The organization relies completely on external information supply e.g., consulting firms","opt2":"The organization acquires new knowledge only sporadically over undefined sources. No process of systematic knowledge acquisition","opt3":"The organization is systematically generating new knowledge e.g. over complaint management, sales meeting etc.","opt4":"The organization has a defined process of knowledge acquisition in different areas. the condensation of knowledge is unstructured. The knowledge is collected often without purpose.","opt5":"The organization has a strong network of knowledge and a dedicated knowledge acquisition process in place (e.g., chatting with customers and suppliers)"}],"vis":[{"id":"vis-1","text":"I know my team's purpose","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"vis-2","text":"I know my team's business targets","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"vis-3","text":"We do have a common target definition process in my team","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"vis-4","text":"In my team we do verify and re-prioritize our targets regularly","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"vis-5","text":"In my team we do reflect our activities in a roadmap","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"}]}
