{"lea":[{"id":"lea-1","text":"In my team we know where and how to address roadblocks","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"lea-2","text":"My teams leaders remove the roadblocks for us","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"lea-3","text":"My teams leaders support our cultural transformation","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"lea-4","text":"We get the right enabling measures and tools to work in an agile set-up","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"lea-5","text":"We have a continuous dialogue with our leaders about the responsibilities in the team","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"lea-6","text":"My teams leaders continuously deploy responsibilities into the team","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"lea-7","text":"My teams leaders accept and trust our decisions","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"lea-8","text":"Decentralized Decision Making - Which answer describes the situation in your team the best?","opt1":"Decisions are centralized, regardless of frequency, time criticality, and impact","opt2":"Decisions are rarely decentralized even if they are frequent, time critical, and do not have global economies of scale","opt3":"Decisions are sometimes decentralized when they are frequent, time critical, and do not have global economies of scale","opt4":"Decisions are usually decentralized when they are frequent, time critical, and do not have global economies of scale","opt5":"Decisions are always decentralized when they are frequent, time critical, and do not have global economies of scale"},{"id":"lea-9","text":"Many of the improvements identified in the retrospective are implemented in the next Sprint","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"lea-10","text":"Team members raise impediments at the daily meetings","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"}],"pro":[{"id":"pro-1","text":"In my team we know our users and maintain an active dialogue with them","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"pro-2","text":"My team understands the needs and requirements of our users","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"pro-3","text":"In my team we focus all our work on the needs / expectations of our users","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"pro-4","text":"My team understands the needs and requirements of our dealers","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"pro-5","text":"We offer the right support & material to our dealers to generate demand for a successful business with our Accessories","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"pro-6","text":"We know the level of the quality our customers expect","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"pro-7","text":"My team meets the quality expectations","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"pro-8","text":"In my team everybody knows our quality standards","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"pro-9","text":"Time to Market: We regularly achieve the Start of Launch we have planned","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"pro-10","text":"In my team we inspect and adapt possible bottlenecks in our value chain","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"pro-11","text":"Time to Market: We consider & respect our lead times","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"pro-12","text":"Team Level Product Management  - Which answer describes the situation in your team the best?","opt1":"Non-existent","opt2":"Working towards the next level over.","opt3":"There is a single product-oriented person that does all of the following: making sure that there are sufficient ready stories at all times, attending all team-oriented planning meetings, accepting stories (for instance during iteration review), prioritizing the backlog. This person is available to fully answer questions about stories that are for the next 2-4 weeks immediately most of the time and within a couple of hours once in a while.","opt4":"80% of the time, people that have an opinion on the content or priority of a user story go to the team-level product person and not to members of the team. There is very close alignment between any product management people outside of the team level and the team level product person.","opt5":"There is an amazing repoir and alignment between strategic level product management, team level product management, and the team. Everybody understands and is executing on the product vision and all interaction within product management and the team and everybody follows well understood patterns and works smoothly."},{"id":"pro-13","text":"Cycle Time  - Which answer describes the situation in your team the best?","opt1":"One year or more from concept to release capability","opt2":"Can go from concept to release capability in 6 months.","opt3":"All work goes from concept to release in 3 months or less.","opt4":"All work goes from concept to release in 2 months or less and it is possible to come from concept to release in weeks.","opt5":"It is possible to get from concept to release in a few days."},{"id":"pro-14","text":"Product Vision  - Which answer describes the situation in your team the best?","opt1":"Not defined","opt2":"It is written down somewhere or the product owner or a similar person knows what it is.","opt3":"There is a written definition that is precise and known to all involved.","opt4":"There is a convincing product vision that can be clearly formulated by the product owner or a similar person.","opt5":"Simple, clear, convincing, all participants can articulate it well."},{"id":"pro-15","text":"The Product Owner has direct contact with customers","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"pro-16","text":"We usually capture many detailed requirements at the beginning of the project","opt1":"Strongly Agree","opt2":"Agree","opt3":"Neutral","opt4":"Disagree","opt5":"Strongly Disagree"}],"tco":[{"id":"tco-1","text":"In my team we do have a regular sprint planning and review","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tco-2","text":"In my team we do define deliverables and acceptance criteria","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tco-3","text":"In my team we do regularly complete our tasks","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tco-4","text":"In my team we defined our decision making processes and everybody understands them","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tco-5","text":"In my team we help and support each other","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tco-6","text":"In my team we synchronize our work regularly based on our needs and targets","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tco-7","text":"We do work cross-functional in my team (within the team itself and with interfacing teams)","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tco-8","text":"We do have the required competences in the team","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tco-9","text":"In the team we all have the same understanding of our roles and responsibilities","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tco-10","text":"I know what I can expect from others and what others can expect from me","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tco-11","text":"In my team we do prioritize our projects according to available capacities","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tco-12","text":"In my team we do limit our Work In Progress (WIP)","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tco-13","text":"We do have a consistent team set-up","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tco-14","text":"We are fully committed to our Purpose, Targets and Roadmap","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tco-15","text":"We do take responsibility for our actions and decisions as a team","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tco-16","text":"My teams backlog is owned and prioritized","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tco-17","text":"We continuously review / renew the backlog (e.g. integration of user / customer feedback)","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tco-18","text":"In my team we have clear targets for our meetings and meet them regularly","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tco-19","text":"In my team we have the right amount of meetings, the right content, frequency and participants","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tco-20","text":"In my team we document outcomes of our meetings in a transparent and understandable way","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tco-21","text":"Meetings - Which answer describes the situation in your team the best?","opt1":"There are no regular meetings in the team","opt2":"Regular scheduled meetings with the core team","opt3":"Regular meetings with 80% of the team","opt4":"Regular meetings with the whole team less frequent than once a week","opt5":"Meetings with the whole team at least once a week"},{"id":"tco-22","text":"Cross-functional - Which answer describes the situation in your team the best?","opt1":"A significant part of what is needed to realize the stories exists outside the team.","opt2":"Some of the skills necessary to do the stories exist outside the team.","opt3":"All the necessary skills to carry out the work are available in the team.","opt4":"All of the necessary skills for performing the work exist on the team and there is some cross training of skills","opt5":"All the necessary skills to carry out the work are available in the team and most of the team is prepared for most of these skills."},{"id":"tco-23","text":"Standups / Check-Ins / Huddles / Coffe Meetings  - Which answer describes the situation in your team the best?","opt1":"Not  held","opt2":"Regularly taking place and on the way to Level 3.","opt3":"80% of the team participate regularly, the main meeting lasts less than 20 minutes, real obstacles are addressed regularly, the focus is on working for this team, the team understands that the meeting is for them.","opt4":"Daily, short, efficient. Works well with or without someone officially in charge of the meeting. The team conducts an on-site analysis of current issues and takes corrective action as required.","opt5":"Positively tailored to the needs of the team."},{"id":"tco-24","text":"Retrospectives - Which answer describes the situation in your team the best?","opt1":"Not  held","opt2":"Held but not regular or not frequent enough.","opt3":"Held regularly, well attended, produces action items. Action items are frequently acted on.","opt4":"Regularly taking place, well attended, it produces action items. Action items are often processed.","opt5":"Creatively managed, format varies from time to time, future-oriented, often produces groundbreaking ideas that are implemented and lead to tangible results."},{"id":"tco-25","text":"Estimation of workload  - Which answer describes the situation in your team the best?","opt1":"Ad-hoc, persons other than those who perform the work make the estimate, or the estimate is based on the work of each function that has been put together.","opt2":"Done on a regular basis","opt3":"The whole team participates in the estimation, estimates are a single measure of work for the whole team (e.g. user points, T-shirt sizes, etc.). Most team members no longer think in pure time based-estimation (e.g., FTE, hours).","opt4":"90+% of the time estimate involves the entire team by using the estimate of the entire team.","opt5":"Consistently performed at least weekly by the entire team using techniques to get an estimation of the entire team."},{"id":"tco-26","text":"Team Size - Which answer describes the situation in your team the best?","opt1":">20 people on team","opt2":"It is recognised that a smaller team size is required and there is either a short-term plan or the team is actively reduced.","opt3":"< 20 people on the team","opt4":"< 10 people on the team","opt5":"7 +/- 2 people on the team"},{"id":"tco-27","text":"Dedicated Team - Which answer describes the situation in your team the best?","opt1":"Most team members are in several teams or work on several projects or have a line function.","opt2":"Most people are at least 50% assigned to the team. No one is less than 30% of the team.","opt3":"Most persons are assigned to the team to >=70%. No one is less than 50% assigned to the team.","opt4":"Most people are >=90% assigned to the team. No one is less than 70% assigned to the team.","opt5":"Most people are 100% assigned to the team, nobody is less than 60% assigned to the team."},{"id":"tco-28","text":"The Team Members are able to step outside their role and be cross functional","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tco-29","text":"Decisions need to be formally documented so we know what was agreed","opt1":"Strongly Agree","opt2":"Agree","opt3":"Neutral","opt4":"Disagree","opt5":"Strongly Disagree"},{"id":"tco-30","text":"The product we are working on reflects our decisions. We do not need detailed history of previous conversations.","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"}],"tcu":[{"id":"tcu-1","text":"We do have quick and easy access to all information we need for our work","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tcu-2","text":"We are involved to the right degree (neither too much nor too little)","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tcu-3","text":"We have working tools which support transparency (e.g. team boards, ...)","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tcu-4","text":"We respect each other's competences and expertise in my team","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tcu-5","text":"We accept failure and do learn from them","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tcu-6","text":"We do listen to each other in my team and accept divers opinions","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tcu-7","text":"Risk awareness: We do identify potential risks systematically","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tcu-8","text":"As a team we do manage risks adequately","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tcu-9","text":"We do reflect our methods, tools, behaviours continuously","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tcu-10","text":"We do adapt the way we work based on our experiences","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tcu-11","text":"We do incorporate successes and improvements in future iterations","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tcu-12","text":"We do know all our stakeholders and their trigger points","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tcu-13","text":"As a team we know what our stakeholders expect from us","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tcu-14","text":"We do involve our stakeholders at the right rime and in the right way","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tcu-15","text":"My team is accepted and appreciated by its stakeholders","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tcu-16","text":"I do feel appreciated for my contributions in my team","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tcu-17","text":"In my team we do celebrate our success and achievements regularly","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tcu-18","text":"Stakeholder Involvement","opt1":"Stakeholders are not involved in the creation of a solution","opt2":"Stakeholders are loosely in contact with the team to discuss deliverables","opt3":"There is a regular and stuctured exchange between stakeholders and team members","opt4":"Stakeholders are involved in the working process and are informed about the different challenges","opt5":"Stakeholders are closely involved in the working process and can access the current state of work (i.e. by giving them access to the team board)"},{"id":"tcu-19","text":"Team Morale - Which answer describes the situation in your team the best?","opt1":"Active resistance to change. People often make hints about resigning or how bad the working environment or climate is.  Behavioural patterns such as finger pointing, denial, anger, screaming, betrayal, passive aggression and/or scapegoat regularly occur.","opt2":"There are still some of the behaviors of the previous situation, but steady improvements are emerging away from these problem areas. Problems are addressed activelly and purposefully with a common awareness that morale is improving.","opt3":"In general, people like to work together and are happy with their work.","opt4":"The team is productive, committed with a good team morale. In general, everyone works motivated and purposefully.","opt5":"The majority of the team members enjoy coming to work and look forward to the tasks ahead and feel they are part of one of the best teams they have ever worked in."},{"id":"tcu-20","text":"Teamwork - Which answer describes the situation in your team the best?","opt1":"Non-existent","opt2":"Teamwork improves","opt3":"At least 70 percent of the optimal setting","opt4":"Optimal setting is in sight - not far away of the ideal state 20 percent to go.","opt5":"Between each individual and every other individual on the team, each believes that the other has the necessary skills, has high integrity, wants and helps them to succeed, and is dependable."},{"id":"tcu-21","text":"Tuckman Stage - Which answer describes the situation in your team the best?","opt1":"Forming. Assemble a new team or integrating a team member who has joined or left the team.","opt2":"Storming. The team is just starting to figure out how to work together, and there is an unusual frequency of conflicts.","opt3":"Norming. The team has discovered the best way to work well together as a team and is on its way to achieving excellence performance.","opt4":"Have performed consistently for at least two months.","opt5":"Have performed consistently for at least six months."},{"id":"tcu-22","text":"Sustainable Pace - Which answer describes the situation in your team the best?","opt1":"People are tired, irritable, burned out, working overtime routinely. The present circumstances are considered business as usual.","opt2":"It is acknowledged that the current pace is not sustainable and measures are being taken to improve the overall situation.","opt3":"There is broad acceptance that the team is working at a pace that is almost sustainable indefinitely, although the workload still does not correlate with the outbursts of heavy workloads.","opt4":"The team is supported by the organisation to work at a continuous speed. The team agrees that in 80% of cases the team works in line with the elements of sustainable speed in its team agreement.","opt5":"The company and the team take active measures to support work at a sustainable pace."},{"id":"tcu-23","text":"Discussion, criticizing and experimenting with the process is welcome","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tcu-24","text":"Feedback is encouraged and captured at regular team meetings","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tcu-25","text":"Overtime is rare and happens voluntarily","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tcu-26","text":"All Team members participate in the daily meetings","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tcu-27","text":"Delivering value is more important than delivering to specification","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tcu-28","text":"Speed to market is more important than perfection","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"}],"tpe":[{"id":"tpe-1","text":"In my team we do believe in ourselves","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tpe-2","text":"Others believe in my teams abilities","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tpe-3","text":"In my team we do plan realistically","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tpe-4","text":"In my team we do act responsibly","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tpe-5","text":"Our stakeholders trust in my teams planning","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tpe-6","text":"We do react to changes openly","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tpe-7","text":"We do consider the effects of changes in our backlog","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tpe-8","text":"Ressource Fluidity - Which answer describes the situation in your team the best?","opt1":"Resources are fix and can not be moved.","opt2":"Resources are checked and assigned twice a year.","opt3":"Resources are allocated on a quarterly basisResources are checked and assigned on a quarterly basis.","opt4":"The resources are allocated quarterly additional resources can be requested - duration about 1-2 months.","opt5":"Ressources can be reassigned and/or moved within a few weeks notice if neccessary."},{"id":"tpe-9","text":"Environmental Scanning - Which answer describes the situation in your team the best?","opt1":"There is no sense and urgency on where to scan and actively search for information and opportunities within the organization.","opt2":"There is very limited sense to scan for new opportunities. Occasionally, there are impulses on where to look for opportunities and information.","opt3":"There is an understanding that environmental scanning is vital and it is on managerial levels.","opt4":"The organization has developed a good sense on where to scan for new opportunities and or developments (e.g., in technology, markets etc.)","opt5":"The organization has developed a strong sense on where to scan for new opportunities and or developments (e.g., in technology, markets etc.)"},{"id":"tpe-10","text":"Knowledge Acquisition - Which answer describes the situation in your team the best?","opt1":"The organization relies completely on external information supply e.g., consulting firms","opt2":"The organization acquires new knowledge only sporatically over undefined sources. No process of systematically knowledge acquisition","opt3":"The organization is systermatically generating new knowledge e.g. over complaint management, sales meeting etc.","opt4":"The organization has a defined process of knowledge acquisition in different areas. the condensation of knowledge is unstructured. The knowledge is collected often without purpose.","opt5":"The organization has a strong network of knowledge and a dedicated knowledge akquisition process in place (e.g., chatting with customers and suppliers)"},{"id":"tpe-11","text":"The Business Owner is empowered to remove impediments for the Team","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tpe-12","text":"The project team can make decisions and provide information when they are required (Just In Time)","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"tpe-13","text":"The Team's historical velocity is used for Sprint Planning","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"}],"vis":[{"id":"vis-1","text":"I know my team's purpose","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"vis-2","text":"I know my teams business targets","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"vis-3","text":"We do have a common target definition process in my team","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"vis-4","text":"In my team we do verify and re-priritize our targets regularly","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"vis-5","text":"In my team we do reflect our activities in a roadmap","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"vis-6","text":"In my team we do continuously adapt our roadmap","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"vis-7","text":"My teams roadmap fits to the overall strategy","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"},{"id":"vis-8","text":"What percentage of planned story points do we reach in a typical sprint?","opt1":"less than 50%","opt2":"50% - 70%","opt3":"70% - 80%","opt4":"80% - 90%","opt5":"90% - 100%"},{"id":"vis-9","text":"Sprints are not interrupted by unplanned work outside of the Sprint Backlog","opt1":"Strongly Disagree","opt2":"Disagree","opt3":"Neutral","opt4":"Agree","opt5":"Strongly Agree"}]}
